app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
    def index
        render json: Airplane.all