app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
---
    def index
        headers['Access-Control-Allow-Origin'] = '*' # FIX CORS ERROR !!!
        render json: Flight.all

SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1  [["origin", "Brisbane"]]
---
    def search
        @origin = Flight.where origin: params[:origin]