app/controllers/flights_controller.rb

    def index
        headers['Access-Control-Allow-Origin'] = '*' # FIX CORS ERROR !!!
        render json: Flight.all.order(:date)
---
SELECT "flights".* FROM "flights" ORDER BY "flights"."date" ASC

    def show
        headers['Access-Control-Allow-Origin'] = '*'
        @flight = Flight.find(params[:id]).order(:date)
        @reservation = Reservation.all.where(flight_id: (params[:id]))
        @plane = Airplane.find_by id:@flight.airplane_id
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."flight_id" = $1  [["flight_id", 62]]
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

    def search
        @flight = Flight.where(origin: params[:origin], destination: params[:destination]).order(:date)
---
SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2 ORDER BY "flights"."date" ASC  [["origin", "Melbourne"], ["destination", "Paris"]]