app/controllers/reservations_controller.rb

  def create

    reservation = Reservation.create! row: params[:row], column: params[:column], flight_id: params[:flight_id]
---
INSERT INTO "reservations" ("row", "column", "flight_id") VALUES ($1, $2, $3) RETURNING "id"  [["row", 10], ["column", 2], ["flight_id", 62]]